# TrussFamilyTopChordVerticalProjectionParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TrussFamilyTopChordVerticalProjectionParam Property
ParameterTypeId Class See Also
---
"Analytical Vertical Projection"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TrussFamilyTopChordVerticalProjectionParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussFamilyTopChordVerticalProjectionParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TrussFamilyTopChordVerticalProjectionParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace